Repository: MisterGeorge/CodeIgniter-Extended
Catalog: system/language/*/LC_MESSAGES/system.po
Languages: portuguese, spanish

source: Su
portuguese: Do
spanish: Do

source: Mo
portuguese: Se
spanish: Lu

source: Tu
portuguese: Te
spanish: Ma

source: We
portuguese: Qu
spanish: Mi

source: Th
portuguese: Qu
spanish: Ju

source: Fr
portuguese: Se
spanish: Vi

source: Sa
portuguese: Sá
spanish: Sá

source: Sun
portuguese: Dom
spanish: Dom

source: Mon
portuguese: Seg
spanish: Lun

source: Tue
portuguese: Ter
spanish: Mar

source: Wed
portuguese: Qua
spanish: Mié

source: Thu
portuguese: Qui
spanish: Jue

source: Fri
portuguese: Sex
spanish: Vie

source: Sat
portuguese: Sáb
spanish: Sáb

source: Sunday
portuguese: Domingo
spanish: Domingo

source: Monday
portuguese: Segunda
spanish: Lunes

source: Tuesday
portuguese: Terça
spanish: Martes

source: Wednesday
portuguese: Quarta
spanish: Miércoles

source: Thursday
portuguese: Quinta
spanish: Jueves

source: Friday
portuguese: Sexta
spanish: Viernes

source: Saturday
portuguese: Sábado
spanish: Sábado

source: Jan
spanish: Ene

source: Apr
portuguese: Abr
spanish: Abr

source: Aug
portuguese: Ago
spanish: Ago

source: Dec
portuguese: Dez
spanish: Dic

source: January
portuguese: Janeiro
spanish: Enero

source: February
portuguese: Fevereiro
spanish: Febrero

source: March
portuguese: Março
spanish: Marzo

source: April
portuguese: Abril
spanish: Abril

source: May
portuguese: Maio
spanish: Mayo

source: June
portuguese: Junho
spanish: Junio

source: July
portuguese: Julho
spanish: Julio

source: August
portuguese: Agosto
spanish: Agosto

source: September
portuguese: Setembro
spanish: Septiembre

source: October
portuguese: Outubro
spanish: Octubre

source: November
portuguese: Novembro
spanish: Noviembre

source: December
portuguese: Dezembro
spanish: Diciembre

source: Year
portuguese: Ano
spanish: Año

source: Years
portuguese: Anos
spanish: Años

source: Month
portuguese: Mês
spanish: Mes

source: Months
portuguese: Meses
spanish: Meses

source: Week
portuguese: Semana
spanish: Semana

source: Weeks
portuguese: Semanas
spanish: Semanas

source: Day
portuguese: Dia
spanish: Día

source: Days
portuguese: Dias
spanish: Días

source: Hour
portuguese: Hora
spanish: Hora

source: Hours
portuguese: Horas
spanish: Horas

source: Minute
portuguese: Minuto
spanish: Minuto

source: Minutes
portuguese: Minutos
spanish: Minutos

source: Second
portuguese: Segundo
spanish: Segundo

source: Seconds
portuguese: Segundos
spanish: Segundos

source: (UTC -12:00) Baker/Howland Island
portuguese: (UTC -12:00) Ilhas Baker/Howland
spanish: (UTC -12:00) Isla Howland/Baker

source: (UTC -10:00) Hawaii-Aleutian Standard Time, Cook Islands, Tahiti
portuguese: (UTC -10:00) Hawai, Ilhas Cook e Aleutas
spanish: (UTC -10:00) Tiempo de Hawái-Aleutiano, Islas Cook, Tahití

source: (UTC -9:30) Marquesas Islands
portuguese: (UTC -9:30) Ilhas Marquesas
spanish: (UTC -9:30) Islas Marquesas

source: (UTC -9:00) Alaska Standard Time, Gambier Islands
portuguese: (UTC -9:00) Alaska, Ilhas Gambier
spanish: (UTC -9:00) Tiempo de Alaska, Islas Gambier

source: (UTC -8:00) Pacific Standard Time, Clipperton Island
portuguese: (UTC -8:00) Zona do pacífico, Ilha de Clipperton
spanish: (UTC -8:00) Tiempo del Pacífico, Isla Clipperton

source: (UTC -7:00) Mountain Standard Time
portuguese: (UTC -7:00) Zona das Montanhas
spanish: (UTC -7:00) Tiempo de la montaña

source: (UTC -6:00) Central Standard Time
portuguese: (UTC -6:00) Zona central da América do Norte
spanish: (UTC -6:00) Hora Estándar del Centro

source: (UTC -5:00) Eastern Standard Time, Western Caribbean Standard Time
portuguese: (UTC -5:00) Zona Leste Americana, Zona Oeste do Caribe
spanish: (UTC -5:00) Tiempo del Este, Hora Estándar del Caribe Occidental

source: (UTC -4:30) Venezuelan Standard Time
portuguese: (UTC -4:30) Venezuela
spanish: (UTC -4:30) Hora Estándar de Venezuela

source: (UTC -4:00) Atlantic Standard Time, Eastern Caribbean Standard Time
portuguese: (UTC -4:00) Zona do Atlântico, Zona Leste do Caribe
spanish: (UTC -4:00) Tiempo Estándar del Atlántico, Hora Estándar del Caribe Oriental

source: (UTC -3:30) Newfoundland Standard Time
portuguese: (UTC -3:30) Terra Nova(Canadá)
spanish: (UTC -3:30) Tiempo de Terranova y Labrador

source: (UTC -3:00) Argentina, Brazil, French Guiana, Uruguay
portuguese: (UTC -3:00) Argentina, Brasil, Guiana Francesa, Uruguai
spanish: (UTC -3:00) Argentina, Brasil, Guayana Francesa, Uruguay

source: (UTC -2:00) South Georgia/South Sandwich Islands
portuguese: (UTC -2:00) Ilhas Georgia do Sul/Sandwich do Sul
spanish: (UTC -2:00) Islas Georgias del Sur/Islas Sandwich del Sur

source: (UTC -1:00) Azores, Cape Verde Islands
portuguese: (UTC -1:00) Açores, Cabo Verde
spanish: (UTC -1:00) Azores, Islas de Cabo Verde

source: (UTC) Greenwich Mean Time, Western European Time
portuguese: (UTC) Horário de Greenwich, Zona Oeste da Europa
spanish: (UTC) Tiempo medio de Greenwich, Hora de Europa Occidental

source: (UTC +1:00) Central European Time, West Africa Time
portuguese: (UTC +1:00) Zona Central da Europa, Zona Oeste de África
spanish: (UTC +1:00) Hora Central Europea, Tiempo de África Occidental

source: (UTC +2:00) Central Africa Time, Eastern European Time, Kaliningrad Time
portuguese: (UTC +2:00) Zona Central de África, Zona Leste da Europa, Zona de Kaliningrado
spanish: (UTC +2:00) Tiempo de África Central, Hora de Europa Oriental, Hora de Kaliningrado

source: (UTC +3:00) Moscow Time, East Africa Time, Arabia Standard Time
portuguese: (UTC +3:00) Zona de Moscovo, Zona Leste de África
spanish: (UTC +3:00) Hora de Moscú, Tiempo de África Oriental, Hora Estándar de Arabia

source: (UTC +3:30) Iran Standard Time
portuguese: (UTC +3:30) Irão
spanish: (UTC +3:30) Hora Estándar de Irán

source: (UTC +4:00) Azerbaijan Standard Time, Samara Time
portuguese: (UTC +4:00) Azerbeijão, Zona da Samara
spanish: (UTC +4:00) Hora Estándar de Azerbaiyán, Hora de Samara

source: (UTC +4:30) Afghanistan
portuguese: (UTC +4:30) Afeganistão
spanish: (UTC +4:30) Afganistán

source: (UTC +5:00) Pakistan Standard Time, Yekaterinburg Time
portuguese: (UTC +5:00) Paquistão, Zona de Ecaterimburgo
spanish: (UTC +5:00) Hora Estándar de Pakistan, Hora de Ekaterimburgo

source: (UTC +5:30) Indian Standard Time, Sri Lanka Time
portuguese: (UTC +5:30) Índia, Sri Lanka
spanish: (UTC +5:30) Hora Estándar de la India, Hora Estándar de Sri Lanka

source: (UTC +5:45) Nepal Time
portuguese: (UTC +5:45) Nepal
spanish: (UTC +5:45) Hora de Nepal

source: (UTC +6:00) Bangladesh Standard Time, Bhutan Time, Omsk Time
portuguese: (UTC +6:00) Bangladesh, Butão, Zona de Omsk
spanish: (UTC +6:00) Hora Estándar de Bangladés, Hora de Bután, Hora de Omsk

source: (UTC +6:30) Cocos Islands, Myanmar
portuguese: (UTC +6:30) Ilhas Cocos, Mianmar
spanish: (UTC +6:30) Islas Cocos, Birmania

source: (UTC +7:00) Krasnoyarsk Time, Cambodia, Laos, Thailand, Vietnam
portuguese: (UTC +7:00) Zona de Krasnoiarsk, Camboja, Laos, Tailândia, Vietnam
spanish: (UTC +7:00) Hora de Krasnoyarsk, Camboya, Laos, Tailandia, Vietnam

source: (UTC +8:00) Australian Western Standard Time, Beijing Time, Irkutsk Time
portuguese: (UTC +8:00) Zona Oeste da Austrália, China, Zona de Irkutsk
spanish: (UTC +8:00) Hora Estándar Occidental Australiana, Hora de Pekín, Hora de Irkutsk

source: (UTC +8:45) Australian Central Western Standard Time
portuguese: (UTC +8:45) Zona Centro-Oeste da Austrália
spanish: (UTC +8:45) Hora Estándar Centro Occidental Australiana

source: (UTC +9:00) Japan Standard Time, Korea Standard Time, Yakutsk Time
portuguese: (UTC +9:00) Japão, Coreia, Zona de Yakutsk
spanish: (UTC +9:00) Hora Estándar de Japón, Hora Estándar de Corea, Hora de Yakutsk

source: (UTC +9:30) Australian Central Standard Time
portuguese: (UTC +9:30) Zona Central da Austrália
spanish: (UTC +9:30) Hora Estándar Central Australiana

source: (UTC +10:00) Australian Eastern Standard Time, Vladivostok Time
portuguese: (UTC +10:00) Zona Leste da Austrália, Zona de Vladivostok
spanish: (UTC +10:00) Hora Estándar Oriental Australiana, Hora de Vladivostok

source: (UTC +10:30) Lord Howe Island
portuguese: (UTC +10:30) Arquipélago Lord Howe
spanish: (UTC +10:30) Isla de Lord Howe

source: (UTC +11:00) Srednekolymsk Time, Solomon Islands, Vanuatu
portuguese: (UTC +11:00) Zona de Lacútia, Ilhas Salomão, Vanuatu
spanish: (UTC +11:00) Hora de Srednekolimsk, Islas Salomón, Vanuatu

source: (UTC +11:30) Norfolk Island
portuguese: (UTC +11:30) Ilha Norfolk
spanish: (UTC +11:30) Isla Norfolk

source: (UTC +12:00) Fiji, Gilbert Islands, Kamchatka Time, New Zealand Standard Time
portuguese: (UTC +12:00) Fiji, Ilhas Gilbert, Zona de Kamchatka, Nova Zelândia
spanish: (UTC +12:00) Fiji, Islas Gilbert, Horario de Kamchatka, Hora estandar de Nueva Zelanda

source: (UTC +12:45) Chatham Islands Standard Time
portuguese: (UTC +12:45) Ilhas Chatham
spanish: (UTC +12:45) Hora Estándar de las Islas Chatham

source: (UTC +13:00) Samoa Time Zone, Phoenix Islands Time, Tonga
portuguese: (UTC +13:00) Ilhas Fénix, Tonga
spanish: (UTC +13:00) Zona horaria de Samoa, Hora de las Islas Fénix, Tonga

source: (UTC +14:00) Line Islands
portuguese: (UTC +14:00) Ilhas da linha
spanish: (UTC +14:00) Islas de la Línea

source: Unable to determine the database settings based on the connection string you submitted.
portuguese: Definições de ligação à base de dados insuficientes, com base na string que introduziu.
spanish: No ha sido posible determinar la configuración de la base de datos basada en la cadena de conexión introducida.

source: Unable to connect to your database server using the provided settings.
portuguese: Incapaz de fazer uma ligação ao servidor da base de dados, com base nas definições que forneceu.
spanish: No ha sido posible conectar al servidor de la base de datos haciendo uso de la configuración proporcionada.

source: Unable to select the specified database: %s
portuguese: Incapaz de selecionar a base de dados indicada: %s
spanish: No ha sido posible seleccionar la base de datos especificada: %s

source: Unable to create the specified database: %s
portuguese: Incapaz de criar a base de dados indicada: %s
spanish: No ha sido posible crear la base de datos especificada: %s

source: The query you submitted is not valid.
portuguese: A query que introduziu não é válida.
spanish: La consulta introducida no es válida.

source: You must set the database table to be used with your query.
portuguese: Tem que especificar a tabela da base dados à qual quer fazer a query.
spanish: Debes fijar la tabla de la base de datos que será usada con tu consulta.

source: You must use the 'set' method to update an entry.
portuguese: Tem que usar o método "set" para atualizar uma entrada.
spanish: Debes usar el método "set" para actualizar una entrada.

source: You must specify an index to match on for batch updates.
portuguese: Tem que indicar o index que quer comparar nas atualizações em massa.
spanish: Debes especificar un índice para emparejar las actualizaciones masivas.

source: One or more rows submitted for batch updating is missing the specified index.
portuguese: Falta o index a uma ou mais linhas submetidas para a atualização em massa.
spanish: A una o más filas introducidas para la actualización masiva le falta el índice especificado.

source: Updates are not allowed unless they contain a 'where' clause.
portuguese: Só é possível fazer atualizações se tiver a cláusula "where".
spanish: Las actualizaciones no están permitidas a no ser que contengan la cláusula "where".

source: Deletes are not allowed unless they contain a 'where' or 'like' clause.
portuguese: Só é possível apagar se tiver a cláulusa "where" ou "like".
spanish: Los borrados no están permitidos a no ser que contengan la cláusula "where" o "like".

source: To fetch fields requires the name of the table as a parameter.
portuguese: É necessário o nome da tabela como um parâmetro para conseguir ir buscar os campos.
spanish: Para obtener campos se requiere el nombre de la tabla como parámetro.

source: This feature is not available for the database you are using.
portuguese: Esta funcionalidade não está disponível para a base de dados que está a usar.
spanish: Esta característica no está disponible para la base de datos que estás usando.

source: Transaction failure: Rollback performed.
portuguese: Falha de transação. Foi reposto o estado anterior (rollback).
spanish: Fallo de transacción: Rollback realizado.

source: Unable to drop the specified database.
portuguese: Não é possível apagar a base de dados indicada
spanish: No ha sido posible borrar la base de datos especificada.

source: Unsupported feature of the database platform you are using.
portuguese: Esta funcionalidade não é suportada pela plataforma de base de dados que está a usar.
spanish: Característica no soportada de la plataforma de bases de datos que estás usando.

source: The file compression format you chose is not supported by your server.
portuguese: O formato de compressão de ficheiros que escolheu não é suportado pelo seu servidor.
spanish: El formato de compresión elegido no está soportado por el servidor.

source: Unable to write data to the file path you have submitted.
portuguese: Incapaz de escrever dados no caminho de ficheiro que indicou.
spanish: No ha sido posible escribir los datos en la ruta de archivo especificada.

source: The cache path you submitted is not valid or writable.
portuguese: O cainho da cache que indicou não é válido ou não é tem permissões de escrita.
spanish: La ruta de la caché introducida no es válida o escribible.

source: A table name is required for that operation.
portuguese: É necessário um nome de tabela para essa operação.
spanish: Se requiere un nombre de tabla para esa operación.

source: A column name is required for that operation.
portuguese: É necessário um nome de coluna para essa operação.
spanish: Se requiere un nombre de columna para esa operación.

source: A column definition is required for that operation.
portuguese: É necessário uma definição de coluna para essa operação.
spanish: Se requiere una definición de columna para esa operación.

source: Unable to set client connection character set: %s
portuguese: Incapaz de definir o set de caratéres da ligação ao cliente: %s
spanish: No ha sido posible fijar en la conexión el conjunto de caracteres: %s

source: A Database Error Occurred
portuguese: Ocorreu um erro na base de dados
spanish: Ha ocurrido un error con la base de datos

source: The email validation method must be passed an array.
portuguese: É necessário passar um array ao método de validação de email.
spanish: Debes pasar un array al método de validación de email.

source: Invalid email address: %s
portuguese: Endereço de email inválido: %s
spanish: Correo electrónico no válido: %s

source: Unable to locate the following email attachment: %s
portuguese: Incapaz de encontrar o seguinte anexo de email: %s
spanish: No ha sido posible encontrar este adjunto: %s

source: Unable to open this attachment: %s
portuguese: Incapaz de abrir este anexo: %s
spanish: No ha sido posible abrir este adjunto: %s

source: Cannot send mail with no 'From' header.
portuguese: Não é possível enviar o email sem definir o cabeçalho "From".
spanish: No se puede enviar un email sin la cabecera "From".

source: You must include recipients: To, Cc, or Bcc
portuguese: Tem que definir os destinatários: To, Cc, ou Bcc
spanish: Debes incluir destinatarios: Para, Cc, o Cco

source: Unable to send email using PHP mail(). Your server might not be configured to send mail using this method.
portuguese: Incapaz de enviar o email através do PHP mail(). O seu servidor pode não estar configurado para enviar mails usando este método.
spanish: No ha sido posible enviar el correo usando PHP mail(). Tu servidor podría no estar configurado para enviar emails con este método.

source: Unable to send email using PHP Sendmail. Your server might not be configured to send mail using this method.
portuguese: Incapaz de enviar o email através do PHP Sendmail. O seu servidor pode não estar configurado para enviar mails usando este método.
spanish: No ha sido posible enviar el correo usando PHP Sendmail. Tu servidor podría no estar configurado para enviar emails con este método.

source: Unable to send email using PHP SMTP. Your server might not be configured to send mail using this method.
portuguese: Incapaz de enviar o email através do PHP SMTP. O seu servidor pode não estar configurado para enviar mails usando este método.
spanish: No ha sido posible enviar el correo usando PHP SMTP. Tu servidor podría no estar configurado para enviar emails con este método.

source: Your message has been successfully sent using the following protocol: %s
portuguese: A sua mensagem foi enviado com sucesso através do seguinte protocolo: %s
spanish: Tu mensaje ha sido enviado con éxito usando este protocolo: %s

source: Unable to open a socket to Sendmail. Please check settings.
portuguese: Incapaz de abrir um socket para o Sendmail. Por favor, confira as definições.
spanish: No ha sido posible abrir un socket a Sendmail. Por favor, comprueba la configuración.

source: You did not specify a SMTP hostname.
portuguese: Não especificou o hostname do SMTP.
spanish: No has especificado un servidor SMTP.

source: The following SMTP error was encountered: %s
portuguese: Foi encontrado o seguinte erro SMTP: %s
spanish: Se ha encontrado este error SMTP: %s

source: Error: You must assign a SMTP username and password.
portuguese: Erro: Tem que definir um username e passowrd para o SMTP.
spanish: Error: Debes asignar un usuario y una contraseña SMTP.

source: Failed to send AUTH LOGIN command. Error: %s
portuguese: Falha no envio do comando AUTH LOGIN. Erro: %s
spanish: Fallo al enviar el comando AUTH LOGIN. Error: %s

source: Failed to authenticate username. Error: %s
portuguese: Falha na autenticação de username. Erro: %s
spanish: Fallo al autenticar el usuario. Error: %s

source: Failed to authenticate password. Error: %s
portuguese: Falha na autenticação da password. Erro: %s
spanish: Fallo al autenticar la contraseña. Error: %s

source: Unable to send data: %s
portuguese: Incapaz de enviar dados: %s
spanish: No ha sido posible enviar los datos: %s

source: Exit status code: %s
portuguese: Código do estado de saída: %s
spanish: Código estado al salir: %s

source: The %s field is required.
portuguese: O campo %sé obrigatório.
spanish: El campo %s es obligatorio.

source: The %s field must have a value.
portuguese: O campo %stem que conter um valor.
spanish: El campo %s debe contener un valor.

source: The %s field must contain a valid email address.
portuguese: O campo %stem que conter um email válido.
spanish: El campo %s debe contener un email válido.

source: The %s field must contain all valid email addresses.
portuguese: O campo %stem que conter todos os emails válidos.
spanish: El campo %s debe contener todos los emails válidos.

source: The %s field must contain a valid URL.
portuguese: O campo %stem que conter um URL válido.
spanish: El campo %s debe contener una URL válida.

source: The %s field must contain a valid IP.
portuguese: O campo %stem que conter um IP válido.
spanish: El campo %s debe contener una IP válida.

source: The %s field must be at least %s characters in length.
portuguese: O campo %stem que conter pelo menos %s caractéres de comprimento.
spanish: El campo %s debe ser de al menos %s caracteres de longitud.

source: The %s field cannot exceed %s characters in length.
portuguese: O campo %snão pode ter mais que %s caractéres de comprimento.
spanish: El campo %s no puede superar los %s caracteres de longitud.

source: The %s field must be exactly %s characters in length.
portuguese: O campo %ste que ter exatamente %s caractéres de comprimento.
spanish: El campo %s debe ser de exactamente %s caracteres de longitud.

source: The %s field may only contain alphabetical characters.
portuguese: O campo %ssó pode conter caractéres do alfabeto.
spanish: El campo %s solo puede contener caracteres alfabéticos.

source: The %s field may only contain alpha-numeric characters.
portuguese: O campo %ssó pode conter caractéres alfa-numéricos.
spanish: El campo %s solo puede contener caracteres alfanuméricos.

source: The %s field may only contain alpha-numeric characters and spaces.
portuguese: O campo %ssó pode conter caractéres alfa-numéricos e espaços.
spanish: El campo %s solo puede contener caracteres alfanuméricos y espacios.

source: The %s field may only contain alpha-numeric characters, underscores, and dashes.
portuguese: O campo %ssó pode conter caractéres alfa-numéricos, underscores e hifens.
spanish: El campo %s solo puede contener caracteres alfanuméricos, guiones bajos y guiones.

source: The %s field must contain only numbers.
portuguese: O campo %ssó pode conter números.
spanish: El campo %s solo puede contener números.

source: The %s field must contain only numeric characters.
portuguese: O campo %ssó pode conter algarismos.
spanish: El campo %s solo puede contener caracteres numéricos.

source: The %s field must contain an integer.
portuguese: O campo %stem que conter um integer.
spanish: El campo %s debe contener un entero.

source: The %s field is not in the correct format.
portuguese: O campo %snão está de acordo com o formato solicitado.
spanish: El campo %s no está en el formato correcto.

source: The %s field does not match the %s field.
portuguese: O campo %snão é idêntico ao campo %s.
spanish: El campo %s no coincide con el campo %s.

source: The %s field must differ from the %s field.
portuguese: O campo %stem que ser diferente do campo %s.
spanish: El campo %s debe ser distinto al campo %s.

source: The %s field must contain a unique value.
portuguese: O campo %stem que conter um valor único.
spanish: El campo %s debe contener un valor único.

source: The %s field must only contain digits.
portuguese: O campo %stem que conter um número natural.
spanish: El campo %s solo puede contener dígitos.

source: The %s field must only contain digits and must be greater than zero.
portuguese: O campo %stem que conter umnúmero natural e diferente de zero.
spanish: El campo %s solo puede contener dígitos y debe ser mayor que cero.

source: The %s field must contain a decimal number.
portuguese: O campo %stem que conter um número decimal.
spanish: El campo %s debe contener un número decimal.

source: The %s field must contain a number less than %s.
portuguese: O campo %stem que conter um número inferior a %s.
spanish: El campo %s debe contener un número menor que %s.

source: The %s field must contain a number less than or equal to %s.
portuguese: O campo %stem que conter um número inferior ou igual a %s.
spanish: El campo %s debe contener un número menor o igual a %s.

source: The %s field must contain a number greater than %s.
portuguese: O campo %stem que conter um número superior a %s.
spanish: El campo %s debe contener un número mayor que %s.

source: The %s field must contain a number greater than or equal to %s.
portuguese: O campo %stem que conter um número superior ou igual a %s.
spanish: El campo %s debe contener un número mayor o igual a %s.

source: Unable to access an error message corresponding to your field name %s.
portuguese: Não existe uma mensagem de erro para o campo com o nome {field}.
spanish: No se ha podido acceder al mensaje de error correspondiente para el campo %s.

source: The %s field must be one of: %s.
portuguese: O campor %stem que ser de um dos seguintes tipos: %s.
spanish: El campo %s debe contener uno de estos: %s.
