Repository: MisterGeorge/CodeIgniter-Extended
Catalog: system/language/*/LC_MESSAGES/system.po
Languages: portuguese, spanish

source: Unable to locate a valid connection ID. Please make sure you are connected before performing any file routines.
portuguese: Incapaz de localizar um ID de ligação válido. Por favor certifique-se que está ligado antes de efetuar quaisquer rotinas de ficheiro.
spanish: No ha sido posible localizar una ID de conexión válida. Por favor, asegúrate de que estás conectado antes de realizar cualquier rutina de archivos.

source: Unable to connect to your FTP server using the supplied hostname.
portuguese: Incapaz de ligar ao seu servidor FTP com o hostname fornecido.
spanish: No ha sido posible conectarse al servidor FTP usando el nombre de host proporcionado.

source: Unable to login to your FTP server. Please check your username and password.
portuguese: Incapaz de fazer o login no seu servidor FTP.Por favor confira o seu username e password.
spanish: No ha sido posible identificarse en el servidor. Por favor, comprueba el usuario y la contraseña.

source: Unable to create the directory you have specified.
portuguese: Incapaz de criar a diretoria que especificou.
spanish: No ha sido posible crear el directorio especificado.

source: Unable to change directories.
portuguese: Incapaz de mudar de diretorias.
spanish: No ha sido posible cambiar de directorio.

source: Unable to set file permissions. Please check your path.
portuguese: Incapaz de definir as permissões do ficheiro. Por favor confira o caminho do ficheiro.
spanish: No ha sido posible configurar los permisos de archivo. Por favor, comprueba tu ruta.

source: Unable to upload the specified file. Please check your path.
portuguese: Incapaz de fazer o upload do ficheiro especificado. Por favor confira o caminho do ficheiro.
spanish: No ha sido posible subir el archivo especificado. Por favor, comprueba tu ruta.

source: Unable to download the specified file. Please check your path.
portuguese: Incapaz de fazer o download do ficheiro especificado. Por favor confira o caminho do ficheiro.
spanish: No ha sido posible descargar el archivo especificado. Por favor, comprueba tu ruta.

source: Unable to locate the source file. Please check your path.
portuguese: Incaapz de localizar o ficheiro de origem. Por favor confira o caminho do ficheiro.
spanish: No ha sido posible localizar el archivo fuente. Por favor, comprueba tu ruta.

source: Unable to rename the file.
portuguese: Incapaz de mudar o nome ao ficheiro.
spanish: No ha sido posible renombrar el archivo.

source: Unable to delete the file.
portuguese: Incaapz de apagar o ficheiro.
spanish: No ha sido posible borrar el archivo.

source: Unable to move the file. Please make sure the destination directory exists.
portuguese: Incapaz de mover o ficheiro. Por favor certifique-se que a diretoria de detino existe..
spanish: No ha sido posible mover el archivo. Por favor, asegúrate de que la carpeta de destino existe.

source: You must specify a source image in your preferences.
portuguese: Tem que especificar uma imagem de origem nas suas definiçãoes.
spanish: Debes especificar una imagen fuente en las preferencias.

source: The GD image library is required for this feature.
portuguese: A biblioteca de imagem GD é necessária para esta funcionalidade.
spanish: Se requiere la librería de imagen GD para esta característica.

source: Your server must support the GD image library in order to determine the image properties.
portuguese: O seu servidor tem que suportar a biblioteca de imagem GD para poder consultar as propriedades da imagem.
spanish: El servidor debe soportar la librería de imagen GD para determinar las propiedades de la imagen.

source: Your server does not support the GD function required to process this type of image.
portuguese: O seu servidor não suporta a função GD necessária para processar este tipo de imagem.
spanish: El servidor no soporta la función de GD requerida para procesar este tipo de imagen.

source: GIF images are often not supported due to licensing restrictions. You may have to use JPG or PNG images instead.
portuguese: As imagens GIF geralmente não são suportadas por questões de licenciamento. Pode ter que usar imagens JPG ou PNG como alternativa.
spanish: Las imágenes GIF no suelen estar soportadas habitualmente a causa de restricciones de licencias. Puede que debas usar imágenes JPG o PNG en su lugar.

source: JPG images are not supported.
portuguese: Imagens JPG não são suportadas.
spanish: Las imágenes JPG no están soportadas.

source: PNG images are not supported.
portuguese: Imagens PNG não são suportadas.
spanish: Las imágenes PNG no están soportadas.

source: The image resize protocol specified in your preferences only works with JPEG or PNG image types.
portuguese: O protocolo de redimensionamento de imagens especificado nas suas definições só funciona com os tipos de imagem JPG ou PNG.
spanish: El protocolo de redimensión de imagen especificado en las preferencias solo funciona con imágenes JPEG o PNG.

source: An error was encountered while attempting to replace the file. Please make sure your file directory is writable.
portuguese: Ocorreu um erro ao tentar substituir o ficheiro. Por favor certifique-se que tem permissões de escrita na diretoria do ficheiro.
spanish: Se ha encontrado un error al intentar reemplazar el archivo. Por favor, asegúrate de que la carpeta es escribible.

source: Image rotation does not appear to be supported by your server.
portuguese: O seu servidor parece não suportar a rotação da imagem.
spanish: Parece que la rotación de imágenes no está soportada en el servidor.

source: The path to your image library is not correct. Please set the correct path in your image preferences.
portuguese: O caminho para a sua biblioteca de imagens não está correto. Por favor corrija o mesmo nas suas definições de imagens.
spanish: La ruta a la librería de imagen no es correcta. Por favor, configura la ruta correcta en las preferencias de imagen.

source: Image processing failed. Please verify that your server supports the chosen protocol and that the path to your image library is correct.
portuguese: Ocorreu uma falha ao processar a imagem. Por favor verifique que o seu servidor suporta o protocolo escolhido e que o caminho para a biblioteca de imagem está correto.
spanish: Ha fallado el tratamiento de la imagen. Por favor, verifica que el servidor soporta el protocolo elegido y que la ruta a la librería de imagen es correcta.

source: An angle of rotation is required to rotate the image.
portuguese: É necessário definir um ângulo de rotação para rodar a imagem.
spanish: Se requiere un ángulo de rotación para rotar la imagen.

source: The path to the image is not correct.
portuguese: O caminho para a imagem não está correto.
spanish: La ruta a la imagen no es correcta.

source: The image copy routine failed.
portuguese: Arotina de cópia da imagem falhou.
spanish: La rutina de copia de imagen ha fallado.

source: Unable to find a font to use.
portuguese: Incapaz de encontrar um tipo de letra para usar.
spanish: No se ha podido encontrar una fuente para su uso.

source: Unable to save the image. Please make sure the image and file directory are writable.
portuguese: Não foi possível guardar a imagem. Por favor certifique-se que tem permissões de escrita da imagem e da diretoria do ficheiro.
spanish: No se ha podido guardar la imagen. Por favor, asegúrate de que la imagen y la carpeta son escribibles.

source: Unable to display the image
portuguese: Não é possível exibir a imagem
spanish: No se puede mostrar la imagen

source: No migrations were found.
portuguese: Não foram encontradas migrações.
spanish: No se ha encontrado ninguna migración.

source: No migration could be found with the version number: %s.
portuguese: Não foram encontradas migrações com a versão: %s.
spanish: No se ha encontrado ninguna migración con el número de versión: %s.

source: There is a gap in the migration sequence near version number: %s.
portuguese: Existe uma falha na sequência de versões das migrações junto à versão: %s.
spanish: Hay un vacío en la migración, cerca del número de versión: %s.

source: There are multiple migrations with the same version number: %s.
portuguese: Existem várias migrações com o mesmo numero de versão: %s.
spanish: Hay múltiples migraciones con el mismo número de versión: %s.

source: The migration class '%s' could not be found.
portuguese: Não foi possível encontrar a classe de migração "%s".
spanish: La clase de migración "%s" no ha podido ser encontrada.

source: The migration class '%s' is missing an 'up' method.
portuguese: Falta o método "up" à classe de migração "%s"
spanish: A la clase de migración "%s" le falta el método "up".

source: The migration class '%s' is missing a 'down' method.
portuguese: Falta o método "down" à classe de migração "%s"
spanish: A la clase de migración "%s" le falta el método "down".

source: Migration '%s' has an invalid filename.
portuguese: A migração "%s" tem um nome de ficheiro inválido.
spanish: La migración "%s" tiene un nombre de archivo no válido.

source: &lsaquo; First
portuguese: &lsaquo; Início
spanish: &lsaquo; Primera

source: Last &rsaquo;
portuguese: Fim &rsaquo;
spanish: Última &rsaquo;

source: DATABASE
portuguese: BASE DE DADOS
spanish: BASE DE DATOS

source: CLASS/METHOD
portuguese: CLASSE / MÉTODO
spanish: CLASE/MÉTODO

source: BENCHMARKS
spanish: PUNTOS DE REFERENCIA

source: QUERIES
spanish: CONSULTAS

source: GET DATA
portuguese: DADOS GET
spanish: DATOS GET

source: POST DATA
portuguese: DADOS POST
spanish: DATOS POST

source: URI STRING
spanish: CADENA URI

source: MEMORY USAGE
portuguese: USO DE MEMÓRIA
spanish: USO DE MEMORIA

source: CONFIG VARIABLES
portuguese: VARIÁVEIS DE CONFIGURAÇÃO
spanish: VARIABLES DE CONFIGURACIÓN

source: SESSION DATA
portuguese: DADOS DA SESSÃO
spanish: DATOS DE SESIÓN

source: HTTP HEADERS
portuguese: CABEÇALHO HTTP
spanish: CABECERAS HTTP

source: Database driver is not currently loaded
portuguese: Os drivers da base de dados não estão carregados.
spanish: El driver de la base de datos no está cargado actualmente

source: No queries were run
portuguese: Não foram feitas queries
spanish: No hubo ninguna consulta

source: No POST data exists
portuguese: Não existem dados POST
spanish: No hay ningún dato POST

source: No GET data exists
portuguese: Não existem dados GET
spanish: No hay ningún dato GET

source: No URI data exists
portuguese: Não existem dados URI
spanish: No hay ningún dato de la URI

source: Memory Usage Unavailable
portuguese: Não é possível consultar uso da memória
spanish: Uso de memoria no disponible

source: No Profile data - all Profiler sections have been disabled.
portuguese: Não há dados de Profile - Todas as secções do Profiler foram desativadas.
spanish: No hay datos del perfilador - todas las secciones han sido deshabilitadas.

source: Hide
portuguese: Esconder
spanish: Ocultar

source: Show
portuguese: Mostrar
spanish: Mostrar

source: seconds
portuguese: segundos
spanish: segundos

source: Test Name
portuguese: Nome do teste
spanish: Nombre del test

source: Test Datatype
portuguese: Datatype do teste
spanish: Tipo de datos del test

source: Expected Datatype
portuguese: Datatype esperado
spanish: Tipo de datos esperado

source: Result
portuguese: Resultado
spanish: Resultado

source: Undefined Test Name
portuguese: Nome de teste não definido
spanish: Nombre del test indefinido

source: File Name
portuguese: Nome do ficheiro
spanish: Nombre del archivo

source: Line Number
portuguese: Número da linha
spanish: Número de línea

source: Passed
portuguese: Passou
spanish: Correcto

source: Failed
portuguese: Falhou
spanish: Fallido

source: Boolean
spanish: Booleano

source: Integer
spanish: Entero

source: Float
spanish: Coma flotante

source: String
spanish: Cadena

source: Object
portuguese: Objeto
spanish: Objeto

source: Resource
portuguese: Recurso
spanish: Recurso

source: Null
portuguese: Vazio
spanish: Nulo

source: Notes
portuguese: Notas
spanish: Notas

source: Unable to find a post variable called userfile.
portuguese: Não foi possível encontrar uma variável POST com o nome userfile.
spanish: No ha sido posible encontrar una variable post llamada userfile.

source: The uploaded file exceeds the maximum allowed size in your PHP configuration file.
portuguese: O ficheiro carregado tem um tamanho superior ao permitido pelo ficheiro de configuração do PHP.
spanish: El archivo subido excede el tamaño máximo permitido por tu configuración de PHP.

source: The uploaded file exceeds the maximum size allowed by the submission form.
portuguese: O ficheiro carregado tem um tamanho superior ao definido no formulário.
spanish: El archivo subido excede el tamaño máximo permitido por el formulario.

source: The file was only partially uploaded.
portuguese: O ficheiro não foi carregado na totalidade.
spanish: El archivo solo se subió parcialmente.

source: The temporary folder is missing.
portuguese: A pasta temporária desapareceu.
spanish: No se encuentra el directorio temporal.

source: The file could not be written to disk.
portuguese: Não foi possível guardar o ficheiro.
spanish: El archivo no pudo ser escrito en el disco.

source: The file upload was stopped by extension.
portuguese: O upload do ficheiro parou por causa da sua extensão.
spanish: La subida del archivo paró por extensión.

source: You did not select a file to upload.
portuguese: Não selecionou nenhum ficheiro para fazer o upload.
spanish: No seleccionaste un archivo para subir.

source: The filetype you are attempting to upload is not allowed.
portuguese: Não é permitido fazer o upload do tipo de ficheiro que selecionou.
spanish: El tipo de archivo que intentas subir no está permitido.

source: The file you are attempting to upload is larger than the permitted size.
portuguese: O tamanho do ficheiro que está a tentar carregar é superior ao permitido.
spanish: El archivo que intentas subir es más grande que el tamaño permitido.

source: The image you are attempting to upload doesn't fit into the allowed dimensions.
portuguese: A imagem que está a tentar carregar tem as dimensões superiores às permitidas.
spanish: La imagen que intentas subir no encaja en las dimensiones permitidas.

source: A problem was encountered while attempting to move the uploaded file to the final destination.
portuguese: Foi encontrado um problema ao tentar mover o ficheiro carregado para o destino final.
spanish: Se encontró un problema al intentar mover el archivo subido a su destino final.

source: The upload path does not appear to be valid.
portuguese: O caminho de upload não parece ser válido.
spanish: La ruta de subida no parece válida.

source: You have not specified any allowed file types.
portuguese: Não especificou nenhum tipo de ficheiro válidos.
spanish: No has especificado ningún tipo de archivo permitido.

source: The file name you submitted already exists on the server.
portuguese: O nome de ficheiro que introduziu já existe no servidor.
spanish: El nombre de archivo que has proporcionado ya existe en el servidor.

source: The upload destination folder does not appear to be writable.
portuguese: A diretoria de upload parece não ter permissões de escrita.
spanish: La carpeta de destino de la subida no parece escribible.

source: The Encrypt library requires the Mcrypt extension.
portuguese: A biblioteca Criptografar exige a extensão Mcrypt.
spanish: La biblioteca de cifrado requiere la extensión Mcrypt.

source: In order to use the encryption class requires that you set an encryption key in your config file.
portuguese: Para usar a classe de criptografia requer que você definir uma chave de criptografia no seu arquivo de configuração.
spanish: Para utilizar la clase de cifrado requiere que establezca una clave de cifrado en el archivo de configuración.

source: Encryption: Unable to find an available encryption driver.
portuguese: Encriptação: Não foi possível localizar um driver de criptografia disponível.
spanish: Cifrado: No se pudo encontrar un controlador de cifrado disponibles.

source: Feb
portuguese: Fev

source: Sep
portuguese: Set

source: Oct
portuguese: Out

source: (UTC -11:00) Niue
portuguese: (UTC -11:00) Samoa Americana, Niue
